{
    "ProjectData":[
    {
    "name": "Excavated Evil",
    "overview": "A co-operative board game that utilizes digital technology to enhance the player experience.",
    "thumbnail": "/excavatedevil.png",
    "urlName":"excavatedevil",
    "images":["/excavatedevil.png","/excavatedevil.png"],
    "type":"games",
    "description":"<p>My project explores ways that technological computation can be used to enhance the experience of playing a board game. A number of sensors are integrated into the board to track player actions and movement. This information is relayed to a built in computer which can then output relevant information to the players via a built in screen or through audio. This technology is unobtrusive, and players interact with the game in the same way that they would any other board game.<p>One trend in video games that Excavated Evil leverages is procedural generation. Each time the game is played, the content of a given board location is different. Traditional board games replicate this effect through mechanics like shuffling and drawing from various card decks. The advantage of handling randomness with a computer is that it reduces the burden of the players. Rather than gathering cards together, shuffling them, and placing the decks in designated locations as setup, the players can focus on playing the game.</p>",

    "platform": "Print",
    "tools": "Arduino, Adobe Illustrator, Photoshop",
    "language": "Python",
    "team": "1",
    "role": "Designer, Programmer"
    },

  {
    "name": "Princess Liberation",
    "overview": "A two player platformer game that subverts the dynamic between Knight and Princess.",
    "thumbnail": "/princess.png",
    "urlName":"liberation",
    "images":["/princess.png"],
    "type":"games",
    "description":"<p>Princess Liberation is a local multiplayer platformer game inspired by the webcomic The Dragon Saves the Princess This Time, in which a knight attempts to 'rescue' a princess from the evil dragon. In a subversion of the usual trope, it turns out that the princess and dragon are actually friends, and the dragon is protecting her from unsuitable suitors.</p><p>I worked together with a team of three other students to translate the web comic into a 2D platformer game. My contributions included managing the project's Github repo, programming all of the UI and camera elements, and implementing the knight's gameplay. We all worked together on the game design, and my teammate's were completely responsible for the artwork, animations, and music.</p><p>One of the more experimental designs we implemented was making the knight's controls exclusive to the keyboard and the princess' exclusive to the mouse. Though the knight's controls are very traditional, using wasd and spacebar to jump, the Princess moves across the screen by using the scrollwheel, and all the rest of her abilities can be performed using right and left clicks.</p>",

    "platform": "Windows PC",
    "tools": "Unity3D",
    "language": "C#",
    "team": "4",
    "role": "Lead Programmer, Co-designer"
  },
    {
    "name": "Unowned Collected",
    "overview": "A board game experiment generated from the rules of several existing games.",
    "thumbnail": "/UnownedCollected4.png",
    "urlName":"unowned",
    "images":["/UnownedCollected.png","/UnownedCollected2.png"],
    "type":"games",
    "description":"<p>Unowned Collected makes use of Python's Natural Language Toolkit to break down the structure of different board games' rulesets. The script I wrote first analyzes the language from each game, then generates a brand new game section by section. After running the program a few times, I took the text output and some images from the original rules and arranged them into a pamphlet using Adobe Illustrator.</p><p>This project was heavily inspired by Sol LeWitt's Wall Drawings. My philosophy is that all games can be considered generative art, and Unowned Collected is a literal expression of that idea.</p>",

    "platform": "Print",
    "tools": "Adobe Illustrator, NLTK",
    "language": "Python",
    "team": "1",
    "role": "Programmer"
  },
  {
    "name": "GATE",
    "overview": "A 2D puzzle platformer about grappling hooks. Initially created for the game jam theme 'color'",
    "thumbnail": "/gate.png",
    "urlName":"gate",
    "images":["/gate2.png"],
    "type":"games",
    "description":"<p>This game was a project for my university's first 24 hour game jam, following the theme 'color'. My primary design goal was to create a fluid and dynamic feeling movement. The player's sole form of movement is by way of grappling hook. However, the player can only grapple to nodes that match the player's current color. Passing through a gate will change the player's color. If the player's color does not match the node when they arrive, they will fall down, instead of locking on to it.\n I am currently working to develop this prototype into a full game by designing more levels, creating more polished art and animations, and adapting the controls for mobile devices.</p>",
    "video":"/gate2.gif",

    "platform": "In Development",
    "tools": "Unity3D",
    "language": "C#",
    "team": "1",
    "role": "Designer, Programmer"
  },
  {
    "name": "Melding into Nothing",
    "overview": "A series of programmatic photo-manipulations of the NYC skyline.",
    "thumbnail": "/skyline.png",
    "urlName":"nyc",
    "images":["/melding1.gif","/melding2.gif"],
    "type":"media",
    "description":"<p>The above artwork was created to express the homesickness and disaffection that I felt when living in New York City for the first time. These gifs were made by taking my own photographs and creating a Processing sketch to manipulate the images pixel by pixel.</p>"
  },
  {
    "name": "Forest Fire",
    "overview": "A modular origami project elegizing California.",
    "thumbnail": "/forestfire1.jpg",
    "urlName":"forestfire",
    "images":["/forestfire3.jpg","/forestfire2.jpg"],
    "type":"media",
    "description":"<p>A California native, I created this project while living in Asia and witnessing California's yearly wildfires from afar. Forest Fire explores the beauty and destruction of wildfires through origami. Viewed from above, these origami trees resemble a colorful arrangement of flowers. From the side, however, their true form becomes cleaer.</p>"
  }
    ]
}


